quest/week-9-10/todo_api/app/controllers/api_controller.rb

  def register
    @body = params.require(:user).permit(:email,:password)
    @user = User.new(@body)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "harry2@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-06-15 14:54:46.679848"], ["updated_at", "2023-06-15 14:54:46.679848"]]

  def login
    @body = params.require(:user).permit(:email,:password)
    @user = User.find_by(email: @body[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "harry@example.com"], ["LIMIT", 1]]