quest/week-9-10/todo_api/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def authenticate_user
    auth_header = request.headers['Authorization']
    token = auth_header.split(' ').last
    decoded_token = JWT.decode token, Rails.application.credentials.secret_key_base, false
    render json: { error: { failed: "ユーザーが登録されていません" }}, status: 401 unless User.find_by(id: decoded_token[0]["user_id"])