quest/week-9-10/todo_api/app/controllers/todo_controller.rb

INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "宿題"], ["created_at", "2023-06-16 00:46:02.092782"], ["updated_at", "2023-06-16 00:46:02.092782"]]
---
  def create
    @request = params.require(:todo).permit(:title)
    @todo = Todo.new(@request)
    if @todo.save

SELECT "todos".* FROM "todos"
---
  def index
    @todos = Todo.all
    render json: {
      todos: @todos.map do |todo|

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "掃除"], ["updated_at", "2023-06-16 00:46:48.741728"], ["id", 2]]
---
  def update
    @todo = Todo.find_by(id: params[:id])
    if @todo.update(params.require(:todo).permit(:title))

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 2]]
---
  def destroy
    @todo = Todo.find_by(id: params[:id])
    if @todo.destroy